// let newArr = ['HTML', 'CSS'];
// newArr[2] = 'JavaScript';
// newArr[1] = 'SCSS';

// console.log(newArr)


let product = [
    'Apple MacBook Pro',
    'Цвет - Cеребристый',
    'Год релиза - 2023',
    'Описание - Ноутбук Apple MacBook Pro ускорит загрузку файлов и способствует плавной навигации между множеством окон. Процессор Apple M1 Pro с 8-ядерной архитектурой поддерживает высокую производительность модели, независимо от выполняемой задачи. Забыть о промедлениях при смене эпизодов во время игровых сессий поможет видеокарта Apple M1 Pro 14-core',
    // 'Характеристики:'
    ['Операционная система - macOS', 'SSD - 1 ТБ', 'Время работы - до 18 часов', 'Оперативная память - 36 ГБ'],
    ['Диагональ - 14.2"', 'Разрешение - 3024x1964"', 'Частота - 120 Гц'],

    // 'Процессор:', 
    ['Процессор - Apple M1 Pro',
        'Общее количество ядер - 8',
        'Количество производительных ядер - 6',
        'Частота процессора - 3.2 ГГц'],
    // 'Размеры:', 
    ['Высота - 31,26 см',
        'Ширина - 22,12 см',
        'Толщина - 1,55 см',
        'Вес - 1,62 кг']
];

// console.log(product[0],product[2])
// console.log(product[3])
// console.log(product[4])
console.log(product[4][3]);